----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 64, 112, 112]           9,408
       BatchNorm2d-2         [32, 64, 112, 112]             128
              ReLU-3         [32, 64, 112, 112]               0
         MaxPool2d-4           [32, 64, 56, 56]               0
            Conv2d-5           [32, 64, 56, 56]          36,864
       BatchNorm2d-6           [32, 64, 56, 56]             128
              ReLU-7           [32, 64, 56, 56]               0
            Conv2d-8           [32, 64, 56, 56]          36,864
       BatchNorm2d-9           [32, 64, 56, 56]             128
             ReLU-10           [32, 64, 56, 56]               0
       BasicBlock-11           [32, 64, 56, 56]               0
           Conv2d-12           [32, 64, 56, 56]          36,864
      BatchNorm2d-13           [32, 64, 56, 56]             128
             ReLU-14           [32, 64, 56, 56]               0
           Conv2d-15           [32, 64, 56, 56]          36,864
      BatchNorm2d-16           [32, 64, 56, 56]             128
             ReLU-17           [32, 64, 56, 56]               0
       BasicBlock-18           [32, 64, 56, 56]               0
           Conv2d-19          [32, 128, 28, 28]          73,728
      BatchNorm2d-20          [32, 128, 28, 28]             256
             ReLU-21          [32, 128, 28, 28]               0
           Conv2d-22          [32, 128, 28, 28]         147,456
      BatchNorm2d-23          [32, 128, 28, 28]             256
           Conv2d-24          [32, 128, 28, 28]           8,192
      BatchNorm2d-25          [32, 128, 28, 28]             256
             ReLU-26          [32, 128, 28, 28]               0
       BasicBlock-27          [32, 128, 28, 28]               0
           Conv2d-28          [32, 128, 28, 28]         147,456
      BatchNorm2d-29          [32, 128, 28, 28]             256
             ReLU-30          [32, 128, 28, 28]               0
           Conv2d-31          [32, 128, 28, 28]         147,456
      BatchNorm2d-32          [32, 128, 28, 28]             256
             ReLU-33          [32, 128, 28, 28]               0
       BasicBlock-34          [32, 128, 28, 28]               0
           Conv2d-35          [32, 256, 14, 14]         294,912
      BatchNorm2d-36          [32, 256, 14, 14]             512
             ReLU-37          [32, 256, 14, 14]               0
           Conv2d-38          [32, 256, 14, 14]         589,824
      BatchNorm2d-39          [32, 256, 14, 14]             512
           Conv2d-40          [32, 256, 14, 14]          32,768
      BatchNorm2d-41          [32, 256, 14, 14]             512
             ReLU-42          [32, 256, 14, 14]               0
       BasicBlock-43          [32, 256, 14, 14]               0
           Conv2d-44          [32, 256, 14, 14]         589,824
      BatchNorm2d-45          [32, 256, 14, 14]             512
             ReLU-46          [32, 256, 14, 14]               0
           Conv2d-47          [32, 256, 14, 14]         589,824
      BatchNorm2d-48          [32, 256, 14, 14]             512
             ReLU-49          [32, 256, 14, 14]               0
       BasicBlock-50          [32, 256, 14, 14]               0
           Conv2d-51            [32, 512, 7, 7]       1,179,648
      BatchNorm2d-52            [32, 512, 7, 7]           1,024
             ReLU-53            [32, 512, 7, 7]               0
           Conv2d-54            [32, 512, 7, 7]       2,359,296
      BatchNorm2d-55            [32, 512, 7, 7]           1,024
           Conv2d-56            [32, 512, 7, 7]         131,072
      BatchNorm2d-57            [32, 512, 7, 7]           1,024
             ReLU-58            [32, 512, 7, 7]               0
       BasicBlock-59            [32, 512, 7, 7]               0
           Conv2d-60            [32, 512, 7, 7]       2,359,296
      BatchNorm2d-61            [32, 512, 7, 7]           1,024
             ReLU-62            [32, 512, 7, 7]               0
           Conv2d-63            [32, 512, 7, 7]       2,359,296
      BatchNorm2d-64            [32, 512, 7, 7]           1,024
             ReLU-65            [32, 512, 7, 7]               0
       BasicBlock-66            [32, 512, 7, 7]               0
AdaptiveAvgPool2d-67            [32, 512, 1, 1]               0
           Linear-68                   [32, 12]           6,156
================================================================
Total params: 11,182,668
Trainable params: 6,156
Non-trainable params: 11,176,512
----------------------------------------------------------------
Input size (MB): 18.38
Forward/backward pass size (MB): 2009.13
Params size (MB): 42.66
Estimated Total Size (MB): 2070.16
----------------------------------------------------------------
